In [1]:
import pandas as pd
import numpy as np

In [2]:
nd = np.arange(15).reshape((5, 3))
nd
df1 = pd.DataFrame(nd, columns=['one', 'two', 'three'])
df1

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8
3    9   10     11
4   12   13     14

In [3]:
df1 + df1

   one  two  three
0    0    2      4
1    6    8     10
2   12   14     16
3   18   20     22
4   24   26     28

In [4]:
df1.apply(np.mean)

one      6.0
two      7.0
three    8.0
dtype: float64

In [6]:
def adder(ele1,ele2):
    return ele1+ele2
df1.pipe(adder,2)

   one  two  three
0    2    3      4
1    5    6      7
2    8    9     10
3   11   12     13
4   14   15     16

In [7]:
df1 + 2

   one  two  three
0    2    3      4
1    5    6      7
2    8    9     10
3   11   12     13
4   14   15     16

In [8]:
df1 * 3

   one  two  three
0    0    3      6
1    9   12     15
2   18   21     24
3   27   30     33
4   36   39     42

In [9]:
df1 % 2

   one  two  three
0    0    1      0
1    1    0      1
2    0    1      0
3    1    0      1
4    0    1      0

In [10]:
df1 // 4

   one  two  three
0    0    0      0
1    0    1      1
2    1    1      2
3    2    2      2
4    3    3      3

In [11]:
df1 / 2

   one  two  three
0  0.0  0.5    1.0
1  1.5  2.0    2.5
2  3.0  3.5    4.0
3  4.5  5.0    5.5
4  6.0  6.5    7.0

In [12]:
df1 - 2

   one  two  three
0   -2   -1      0
1    1    2      3
2    4    5      6
3    7    8      9
4   10   11     12

In [13]:
df1.mean(axis=0)

one      6.0
two      7.0
three    8.0
dtype: float64

In [22]:
df1.mean(axis=1)

0     1.0
1     4.0
2     7.0
3    10.0
4    13.0
dtype: float64

In [17]:
df1.apply(np.mean, axis=0)

one      6.0
two      7.0
three    8.0
dtype: float64

In [28]:
df1.apply(np.mean, axis=1)

0     1.0
1     4.0
2     7.0
3    10.0
4    13.0
dtype: float64

In [31]:
df1.applymap(lambda x: x*10)

   one  two  three
0    0   10     20
1   30   40     50
2   60   70     80
3   90  100    110
4  120  130    140